---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PipingGenderType
source: html/49a24888-1a42-fd02-af1e-e210d08799d4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PipingGenderType Property

"Gender Type"

## Syntax (C#)
```csharp
public static ForgeTypeId PipingGenderType { get; }
```